## Data manipulation and analysis with pandas
these are the key tasks in any datascience or data analyst project. Pandas provides wide range of fxns for it , making it easier to clean ,tranform and extrct insights from data.

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('sales_data.csv')
# fetch the first 5 rows
df.head(5)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [6]:
df.tail(5)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
95,Sub-Saharan Africa,Mali,Clothes,Online,M,7/26/2011,512878119,9/3/2011,888,109.28,35.84,97040.64,31825.92,65214.72
96,Asia,Malaysia,Fruits,Offline,L,11/11/2011,810711038,12/28/2011,6267,9.33,6.92,58471.11,43367.64,15103.47
97,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,6/1/2016,728815257,6/29/2016,1485,154.06,90.93,228779.10,135031.05,93748.05
98,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,8/8/2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,2/10/2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [7]:
df.describe()      # to get statistical summary of numerical columns

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

In [6]:
df.dtypes

Region             object
Country            object
Item Type          object
Sales Channel      object
Order Priority     object
Order Date         object
Order ID            int64
Ship Date          object
Units Sold          int64
Unit Price        float64
Unit Cost         float64
Total Revenue     float64
Total Cost        float64
Total Profit      float64
dtype: object

In [ ]:
## Handling Missing Values
df.isnull().any()         # agr true hoga to column me missing values hain

Region            False
Country           False
Item Type         False
Sales Channel     False
Order Priority    False
Order Date        False
Order ID          False
Ship Date         False
Units Sold        False
Unit Price        False
Unit Cost         False
Total Revenue     False
Total Cost        False
Total Profit      False
dtype: bool

In [12]:
df.isnull().sum()      # har column me kitni missing values hain

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

In [ ]:
## filling missing values with mean (for numerical columns)
df['Sales_fillNA']=df['Sales'].fillna(df['Sales'].mean())
df

In [7]:
df.dtypes

Region             object
Country            object
Item Type          object
Sales Channel      object
Order Priority     object
Order Date         object
Order ID            int64
Ship Date          object
Units Sold          int64
Unit Price        float64
Unit Cost         float64
Total Revenue     float64
Total Cost        float64
Total Profit      float64
dtype: object

In [9]:
## Renaming Columns
df = df.rename(columns={'Order Date':'Sale Date'})
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Sale Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [11]:
groupedmean=df.groupby('Item Type')['Unit Price'].mean()
print(groupedmean)

Item Type
Baby Food          255.28
Beverages           47.45
Cereal             205.70
Clothes            109.28
Cosmetics          437.20
Fruits               9.33
Household          668.27
Meat               421.89
Office Supplies    651.21
Personal Care       81.73
Snacks             152.58
Vegetables         154.06
Name: Unit Price, dtype: float64

In [12]:
groupedsum=df.groupby(['Item Type','Region'])['Unit Price'].sum()
print(groupedsum)

Item Type        Region
Baby Food        Australia and Oceania                 510.56
                 Europe                               1021.12
                 Sub-Saharan Africa                    255.28
Beverages        Australia and Oceania                  94.90
                 Central America and the Caribbean      47.45
                 Europe                                 94.90
                 Sub-Saharan Africa                    142.35
Cereal           Australia and Oceania                 205.70
                 Central America and the Caribbean     205.70
                 Middle East and North Africa          205.70
                 Sub-Saharan Africa                    822.80
Clothes          Asia                                  218.56
                 Australia and Oceania                 109.28
                 Central America and the Caribbean     109.28
                 Europe                                327.84
                 Middle East and North Africa          218.56
                 Sub-Saharan Africa                    437.12
Cosmetics        Asia                                  437.20
                 Australia and Oceania                 437.20
                 Central America and the Caribbean     437.20
                 Europe                               2186.00
                 Middle East and North Africa         1311.60
                 Sub-Saharan Africa                    874.40
Fruits           Asia                                    9.33
                 Australia and Oceania                  18.66
                 Middle East and North Africa           27.99
                 Sub-Saharan Africa                     37.32
Household        Asia                                 1336.54
                 Central America and the Caribbean     668.27
                 Europe                               1336.54
                 North America                         668.27
                 Sub-Saharan Africa                   2004.81
Meat             Australia and Oceania                 421.89
                 Sub-Saharan Africa                    421.89
Office Supplies  Asia                                 1302.42
                 Australia and Oceania                 651.21
                 Europe                               1953.63
                 Middle East and North Africa          651.21
                 Sub-Saharan Africa                   3256.05
Personal Care    Asia                                   81.73
                 Central America and the Caribbean      81.73
                 Europe                                163.46
                 North America                         163.46
                 Sub-Saharan Africa                    326.92
Snacks           Central America and the Caribbean     152.58
                 Sub-Saharan Africa                    305.16
Vegetables       Asia                                  308.12
                 Europe                                154.06
                 Sub-Saharan Africa                    462.18
Name: Unit Price, dtype: float64

In [13]:
## aggregate multiple fxns
groupedagg=df.groupby('Region')['Unit Price'].agg(['mean','sum','count'])
groupedagg

                                         mean      sum  count
Region
Asia                               335.809091  3693.90     11
Australia and Oceania              222.672727  2449.40     11
Central America and the Caribbean  243.172857  1702.21      7
Europe                             328.979545  7237.55     22
Middle East and North Africa       241.506000  2415.06     10
North America                      277.243333   831.73      3
Sub-Saharan Africa                 259.618889  9346.28     36

In [14]:
## Merging and joining Dataframes
# Create sample dataframes 
df1=pd.DataFrame({'key':['A','B','c'],'Value1':[1,2,3]})
df2=pd.DataFrame({'key':['A','B','D'],'Value2':[4,5,6]})

In [15]:
df1

  key  Value1
0   A       1
1   B       2
2   c       3

In [16]:
df2

  key  Value2
0   A       4
1   B       5
2   D       6

In [17]:
# Merge dataframe on the key column
pd.merge(df1,df2,on='key',how="inner")

  key  Value1  Value2
0   A       1       4
1   B       2       5

In [18]:
pd.merge(df1,df2,on='key',how="outer")

  key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   D     NaN     6.0
3   c     3.0     NaN

In [19]:
pd.merge(df1,df2,on='key',how="left")

  key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   c       3     NaN

In [20]:
pd.merge(df1,df2,on='key',how="right")

  key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6